performance/raquetelio/results/wave4_Tests_121_131/Tests_121_126_20221121/artilleryRaceRegistration_result_Test124_2022-11-21-23-37-1669070244.txt
Phase started: Massive load (index: 0, duration: 30s) 23:37:29(+0100)

--------------------------------------
Metrics for period to: 23:37:30(+0100) (width: 0.252s)
--------------------------------------

http.codes.201: ................................................................ 6
http.codes.400: ................................................................ 2
http.request_rate: ............................................................. 14/sec
http.requests: ................................................................. 14
http.response_time:
  min: ......................................................................... 19
  max: ......................................................................... 93
  median: ...................................................................... 40
  p95: ......................................................................... 53
  p99: ......................................................................... 53
http.responses: ................................................................ 8
vusers.completed: .............................................................. 8
vusers.created: ................................................................ 15
vusers.created_by_name.Register in Race by Order: .............................. 15
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 27.8
  max: ......................................................................... 222.8
  median: ...................................................................... 62.2
  p95: ......................................................................... 133
  p99: ......................................................................... 133


--------------------------------------
Metrics for period to: 23:37:40(+0100) (width: 9.991s)
--------------------------------------

http.codes.201: ................................................................ 214
http.codes.400: ................................................................ 169
http.codes.500: ................................................................ 35
http.request_rate: ............................................................. 369/sec
http.requests: ................................................................. 3677
http.response_time:
  min: ......................................................................... 18
  max: ......................................................................... 9158
  median: ...................................................................... 1863.5
  p95: ......................................................................... 5378.9
  p99: ......................................................................... 6439.7
http.responses: ................................................................ 418
vusers.completed: .............................................................. 418
vusers.created: ................................................................ 3678
vusers.created_by_name.Register in Race by Order: .............................. 3678
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 29.6
  max: ......................................................................... 9160.8
  median: ...................................................................... 1901.1
  p95: ......................................................................... 5378.9
  p99: ......................................................................... 6569.8


--------------------------------------
Metrics for period to: 23:37:50(+0100) (width: 9.986s)
--------------------------------------

http.codes.201: ................................................................ 132
http.codes.400: ................................................................ 102
http.codes.500: ................................................................ 8
http.request_rate: ............................................................. 437/sec
http.requests: ................................................................. 4365
http.response_time:
  min: ......................................................................... 6926
  max: ......................................................................... 17941
  median: ...................................................................... 9999.2
  p95: ......................................................................... 15526
  p99: ......................................................................... 17859.2
http.responses: ................................................................ 242
vusers.completed: .............................................................. 242
vusers.created: ................................................................ 4365
vusers.created_by_name.Register in Race by Order: .............................. 4365
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6929.9
  max: ......................................................................... 17951.6
  median: ...................................................................... 9999.2
  p95: ......................................................................... 15526
  p99: ......................................................................... 17859.2


--------------------------------------
Metrics for period to: 23:38:00(+0100) (width: 9.998s)
--------------------------------------

http.codes.201: ................................................................ 179
http.codes.400: ................................................................ 253
http.codes.500: ................................................................ 9
http.request_rate: ............................................................. 495/sec
http.requests: ................................................................. 4941
http.response_time:
  min: ......................................................................... 16038
  max: ......................................................................... 28284
  median: ...................................................................... 21813.5
  p95: ......................................................................... 27181.5
  p99: ......................................................................... 28290.8
http.responses: ................................................................ 441
vusers.completed: .............................................................. 441
vusers.created: ................................................................ 4942
vusers.created_by_name.Register in Race by Order: .............................. 4942
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16052.4
  max: ......................................................................... 28298.4
  median: ...................................................................... 21813.5
  p95: ......................................................................... 27181.5
  p99: ......................................................................... 28290.8


--------------------------------------
Metrics for period to: 23:38:10(+0100) (width: 9.992s)
--------------------------------------

http.codes.201: ................................................................ 33
http.codes.400: ................................................................ 50
http.codes.500: ................................................................ 2
http.request_rate: ............................................................. 166/sec
http.requests: ................................................................. 1654
http.response_time:
  min: ......................................................................... 27343
  max: ......................................................................... 35543
  median: ...................................................................... 31266.3
  p95: ......................................................................... 34554.7
  p99: ......................................................................... 35252.8
http.responses: ................................................................ 85
vusers.completed: .............................................................. 85
vusers.created: ................................................................ 1652
vusers.created_by_name.Register in Race by Order: .............................. 1652
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 27344.9
  max: ......................................................................... 35545.8
  median: ...................................................................... 31266.3
  p95: ......................................................................... 34554.7
  p99: ......................................................................... 35252.8


--------------------------------------
Metrics for period to: 23:38:20(+0100) (width: 9.995s)
--------------------------------------

http.codes.201: ................................................................ 23
http.codes.400: ................................................................ 64
http.codes.500: ................................................................ 17
http.request_rate: ............................................................. 79/sec
http.requests: ................................................................. 784
http.response_time:
  min: ......................................................................... 35135
  max: ......................................................................... 45643
  median: ...................................................................... 42205.5
  p95: ......................................................................... 44815.4
  p99: ......................................................................... 45720.8
http.responses: ................................................................ 104
vusers.completed: .............................................................. 104
vusers.created: ................................................................ 783
vusers.created_by_name.Register in Race by Order: .............................. 783
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 35135.9
  max: ......................................................................... 45691.8
  median: ...................................................................... 42205.5
  p95: ......................................................................... 45720.8
  p99: ......................................................................... 45720.8


--------------------------------------
Metrics for period to: 23:38:30(+0100) (width: 9.934s)
--------------------------------------

http.codes.201: ................................................................ 86
http.codes.400: ................................................................ 160
http.codes.500: ................................................................ 64
http.codes.504: ................................................................ 3
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 755
http.response_time:
  min: ......................................................................... 48220
  max: ......................................................................... 57301
  median: ...................................................................... 52591.6
  p95: ......................................................................... 55843.8
  p99: ......................................................................... 55843.8
http.responses: ................................................................ 313
vusers.completed: .............................................................. 313
vusers.created: ................................................................ 755
vusers.created_by_name.Register in Race by Order: .............................. 755
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48230.8
  max: ......................................................................... 57332
  median: ...................................................................... 52591.6
  p95: ......................................................................... 55843.8
  p99: ......................................................................... 55843.8


--------------------------------------
Metrics for period to: 23:38:40(+0100) (width: 9.992s)
--------------------------------------

http.codes.201: ................................................................ 248
http.codes.400: ................................................................ 237
http.codes.500: ................................................................ 145
http.codes.504: ................................................................ 359
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 508
http.response_time:
  min: ......................................................................... 52667
  max: ......................................................................... 64777
  median: ...................................................................... 59297.1
  p95: ......................................................................... 62964
  p99: ......................................................................... 64236
http.responses: ................................................................ 989
vusers.completed: .............................................................. 989
vusers.created: ................................................................ 508
vusers.created_by_name.Register in Race by Order: .............................. 508
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 52674.2
  max: ......................................................................... 64812.2
  median: ...................................................................... 59297.1
  p95: ......................................................................... 62964
  p99: ......................................................................... 64236


--------------------------------------
Metrics for period to: 23:38:50(+0100) (width: 9.976s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 7
http.codes.201: ................................................................ 120
http.codes.400: ................................................................ 177
http.codes.500: ................................................................ 20
http.codes.504: ................................................................ 1808
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 519
http.response_time:
  min: ......................................................................... 57979
  max: ......................................................................... 70727
  median: ...................................................................... 64236
  p95: ......................................................................... 69586.2
  p99: ......................................................................... 69586.2
http.responses: ................................................................ 2125
vusers.completed: .............................................................. 2125
vusers.created: ................................................................ 520
vusers.created_by_name.Register in Race by Order: .............................. 520
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 58010.9
  max: ......................................................................... 70739
  median: ...................................................................... 64236
  p95: ......................................................................... 69586.2
  p99: ......................................................................... 69586.2


--------------------------------------
Metrics for period to: 23:39:00(+0100) (width: 9.973s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 9
errors.ETIMEDOUT: .............................................................. 12
http.codes.504: ................................................................ 1658
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 570
http.response_time:
  min: ......................................................................... 59016
  max: ......................................................................... 79494
  median: ...................................................................... 66857.6
  p95: ......................................................................... 73889.3
  p99: ......................................................................... 78458.5
http.responses: ................................................................ 1658
vusers.completed: .............................................................. 1656
vusers.created: ................................................................ 569
vusers.created_by_name.Register in Race by Order: .............................. 569
vusers.failed: ................................................................. 21
vusers.session_length:
  min: ......................................................................... 59024
  max: ......................................................................... 79511.4
  median: ...................................................................... 66857.6
  p95: ......................................................................... 73889.3
  p99: ......................................................................... 78458.5


--------------------------------------
Metrics for period to: 23:39:10(+0100) (width: 9.976s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 10
errors.ETIMEDOUT: .............................................................. 865
http.codes.504: ................................................................ 1843
http.request_rate: ............................................................. 111/sec
http.requests: ................................................................. 1036
http.response_time:
  min: ......................................................................... 65113
  max: ......................................................................... 80836
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 1843
vusers.completed: .............................................................. 1845
vusers.created: ................................................................ 1037
vusers.created_by_name.Register in Race by Order: .............................. 1037
vusers.failed: ................................................................. 875
vusers.session_length:
  min: ......................................................................... 65166.3
  max: ......................................................................... 80837.5
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:39:20(+0100) (width: 9.981s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 11
errors.ETIMEDOUT: .............................................................. 2740
http.codes.504: ................................................................ 1922
http.request_rate: ............................................................. 173/sec
http.requests: ................................................................. 1721
http.response_time:
  min: ......................................................................... 54103
  max: ......................................................................... 80803
  median: ...................................................................... 75382
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 1922
vusers.completed: .............................................................. 1922
vusers.created: ................................................................ 1720
vusers.created_by_name.Register in Race by Order: .............................. 1720
vusers.failed: ................................................................. 2751
vusers.session_length:
  min: ......................................................................... 54160.8
  max: ......................................................................... 80873.9
  median: ...................................................................... 75382
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:39:30(+0100) (width: 9.935s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 9
errors.ETIMEDOUT: .............................................................. 870
http.codes.504: ................................................................ 604
http.request_rate: ............................................................. 190/sec
http.requests: ................................................................. 1881
http.response_time:
  min: ......................................................................... 53585
  max: ......................................................................... 80053
  median: ...................................................................... 69586.2
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 604
vusers.completed: .............................................................. 604
vusers.created: ................................................................ 1881
vusers.created_by_name.Register in Race by Order: .............................. 1881
vusers.failed: ................................................................. 879
vusers.session_length:
  min: ......................................................................... 53656.3
  max: ......................................................................... 80055.5
  median: ...................................................................... 69586.2
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:39:40(+0100) (width: 9.967s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 316
http.codes.504: ................................................................ 4
http.request_rate: ............................................................. 95/sec
http.requests: ................................................................. 932
http.response_time:
  min: ......................................................................... 71306
  max: ......................................................................... 72627
  median: ...................................................................... 70992
  p95: ......................................................................... 72426.2
  p99: ......................................................................... 72426.2
http.responses: ................................................................ 4
vusers.completed: .............................................................. 4
vusers.created: ................................................................ 932
vusers.created_by_name.Register in Race by Order: .............................. 932
vusers.failed: ................................................................. 316
vusers.session_length:
  min: ......................................................................... 71315.1
  max: ......................................................................... 72669.6
  median: ...................................................................... 70992
  p95: ......................................................................... 72426.2
  p99: ......................................................................... 72426.2


--------------------------------------
Metrics for period to: 23:39:50(+0100) (width: 9.994s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 627
http.codes.504: ................................................................ 17
http.request_rate: ............................................................. 172/sec
http.requests: ................................................................. 1713
http.response_time:
  min: ......................................................................... 63015
  max: ......................................................................... 78365
  median: ...................................................................... 66857.6
  p95: ......................................................................... 75382
  p99: ......................................................................... 75382
http.responses: ................................................................ 17
vusers.completed: .............................................................. 17
vusers.created: ................................................................ 1715
vusers.created_by_name.Register in Race by Order: .............................. 1715
vusers.failed: ................................................................. 627
vusers.session_length:
  min: ......................................................................... 63027.9
  max: ......................................................................... 78376.2
  median: ...................................................................... 66857.6
  p95: ......................................................................... 75382
  p99: ......................................................................... 75382


--------------------------------------
Metrics for period to: 23:40:00(+0100) (width: 9.998s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 424
http.codes.504: ................................................................ 74
http.request_rate: ............................................................. 226/sec
http.requests: ................................................................. 2253
http.response_time:
  min: ......................................................................... 73856
  max: ......................................................................... 79919
  median: ...................................................................... 76904.9
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 74
vusers.completed: .............................................................. 74
vusers.created: ................................................................ 2251
vusers.created_by_name.Register in Race by Order: .............................. 2251
vusers.failed: ................................................................. 424
vusers.session_length:
  min: ......................................................................... 73864.9
  max: ......................................................................... 79998.1
  median: ...................................................................... 76904.9
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6


Phase completed: Massive load (index: 0, duration: 30s) 23:40:10(+0100)

--------------------------------------
Metrics for period to: 23:40:10(+0100) (width: 9.992s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 438
http.codes.504: ................................................................ 70
http.request_rate: ............................................................. 240/sec
http.requests: ................................................................. 2389
http.response_time:
  min: ......................................................................... 73565
  max: ......................................................................... 79976
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 70
vusers.completed: .............................................................. 70
vusers.created: ................................................................ 2390
vusers.created_by_name.Register in Race by Order: .............................. 2390
vusers.failed: ................................................................. 438
vusers.session_length:
  min: ......................................................................... 73616.2
  max: ......................................................................... 79977.6
  median: ...................................................................... 76904.9
  p95: ......................................................................... 80043.6
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:40:20(+0100) (width: 9.571s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 560
http.codes.504: ................................................................ 16
http.request_rate: ............................................................. 288/sec
http.requests: ................................................................. 288
http.response_time:
  min: ......................................................................... 54057
  max: ......................................................................... 54094
  median: ...................................................................... 53654.1
  p95: ......................................................................... 53654.1
  p99: ......................................................................... 53654.1
http.responses: ................................................................ 16
vusers.completed: .............................................................. 16
vusers.created: ................................................................ 287
vusers.created_by_name.Register in Race by Order: .............................. 287
vusers.failed: ................................................................. 560
vusers.session_length:
  min: ......................................................................... 54089.1
  max: ......................................................................... 69386
  median: ...................................................................... 61717.2
  p95: ......................................................................... 61717.2
  p99: ......................................................................... 61717.2


--------------------------------------
Metrics for period to: 23:40:30(+0100) (width: 9.599s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 893
http.codes.504: ................................................................ 968
http.response_time:
  min: ......................................................................... 58137
  max: ......................................................................... 68586
  median: ...................................................................... 62964
  p95: ......................................................................... 68208.3
  p99: ......................................................................... 68208.3
http.responses: ................................................................ 968
vusers.completed: .............................................................. 967
vusers.failed: ................................................................. 893
vusers.session_length:
  min: ......................................................................... 58282.5
  max: ......................................................................... 79100.4
  median: ...................................................................... 69586.2
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 78458.5


--------------------------------------
Metrics for period to: 23:40:40(+0100) (width: 9.998s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 807
http.codes.504: ................................................................ 1461
http.response_time:
  min: ......................................................................... 62272
  max: ......................................................................... 74870
  median: ...................................................................... 70992
  p95: ......................................................................... 73889.3
  p99: ......................................................................... 73889.3
http.responses: ................................................................ 1461
vusers.completed: .............................................................. 1462
vusers.failed: ................................................................. 807
vusers.session_length:
  min: ......................................................................... 62273.7
  max: ......................................................................... 80274.8
  median: ...................................................................... 72426.2
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:40:50(+0100) (width: 9.966s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 218
http.codes.504: ................................................................ 1526
http.response_time:
  min: ......................................................................... 56778
  max: ......................................................................... 79917
  median: ...................................................................... 66857.6
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 78458.5
http.responses: ................................................................ 1526
vusers.completed: .............................................................. 1526
vusers.failed: ................................................................. 218
vusers.session_length:
  min: ......................................................................... 56779.5
  max: ......................................................................... 79957.3
  median: ...................................................................... 66857.6
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:41:00(+0100) (width: 6.758s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 105
http.codes.504: ................................................................ 2224
http.response_time:
  min: ......................................................................... 57928
  max: ......................................................................... 80003
  median: ...................................................................... 64236
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 78458.5
http.responses: ................................................................ 2224
vusers.completed: .............................................................. 2224
vusers.failed: ................................................................. 105
vusers.session_length:
  min: ......................................................................... 57957.8
  max: ......................................................................... 80062.9
  median: ...................................................................... 64236
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6


--------------------------------------
Metrics for period to: 23:41:10(+0100) (width: 8.502s)
--------------------------------------

http.codes.504: ................................................................ 960
http.response_time:
  min: ......................................................................... 56207
  max: ......................................................................... 75329
  median: ...................................................................... 61717.2
  p95: ......................................................................... 66857.6
  p99: ......................................................................... 66857.6
http.responses: ................................................................ 960
vusers.completed: .............................................................. 960
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 56208.3
  max: ......................................................................... 75404.5
  median: ...................................................................... 61717.2
  p95: ......................................................................... 66857.6
  p99: ......................................................................... 66857.6


--------------------------------------
Metrics for period to: 23:41:20(+0100) (width: 9.832s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 1045
http.codes.504: ................................................................ 1082
http.response_time:
  min: ......................................................................... 59503
  max: ......................................................................... 80040
  median: ...................................................................... 68208.3
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 1082
vusers.completed: .............................................................. 1082
vusers.failed: ................................................................. 1045
vusers.session_length:
  min: ......................................................................... 59505.6
  max: ......................................................................... 80041.8
  median: ...................................................................... 68208.3
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6


All VUs finished. Total time: 4 minutes, 0 seconds

--------------------------------
Summary report @ 23:41:27(+0100)
--------------------------------

errors.ECONNREFUSED: ........................................................... 46
errors.ETIMEDOUT: .............................................................. 10082
http.codes.201: ................................................................ 1041
http.codes.400: ................................................................ 1214
http.codes.500: ................................................................ 300
http.codes.504: ................................................................ 17317
http.request_rate: ............................................................. 132/sec
http.requests: ................................................................. 30000
http.response_time:
  min: ......................................................................... 18
  max: ......................................................................... 80836
  median: ...................................................................... 66857.6
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6
http.responses: ................................................................ 19872
vusers.completed: .............................................................. 19872
vusers.created: ................................................................ 30000
vusers.created_by_name.Register in Race by Order: .............................. 30000
vusers.failed: ................................................................. 10128
vusers.session_length:
  min: ......................................................................... 27.8
  max: ......................................................................... 80873.9
  median: ...................................................................... 66857.6
  p95: ......................................................................... 78458.5
  p99: ......................................................................... 80043.6